USE master

CREATE database Salary

USE Salary
CREATE TABLE Зарплата
(  [ФИО] nvarchar(50)  NOT NULL DEFAULT ('---'), 
   [Должность] nvarchar(50) NOT NULL DEFAULT ('---'), 
   [Стаж, лет] int NOT NULL DEFAULT ((0)), 
   [Оклад, руб] float NOT NULL DEFAULT ((0)), 
   [Премия, руб] float NOT NULL DEFAULT ((0)), 
   [Надбавка за стаж, руб] float NOT NULL DEFAULT ((0)), 
   [Итого, руб] float NOT NULL DEFAULT ((0)), 
   [Налоги, руб] float NOT NULL DEFAULT ((0)), 
   [Получить, руб] float NOT NULL DEFAULT ((0)) 
) 

INSERT into Зарплата (ФИО, Должность, [Стаж, лет], [Оклад, руб], [Премия, руб])
  Values('Афанасьева А.И.', 'Генеральный директор', 16, 3000, 105),
	      ('Дудин Е.А.', 'Директор отдела маркетинга', 9, 2180, 300),
	      ('Ковалев Д.М.', 'HR-менеджер', 5, 1200, 100),
	      ('Кежар В.П.', 'Инспектор по кадрам', 20, 2500, 200),
	      ('Ивицкая Н.И.', 'Главный бухгалтер', 12, 1700, 655),
		  ('Лемешевский Влад', 'Junior-developer', 2, 2100, 322)

		  drop table Зарплата

select count(*) from dbo.Зарплата



update Зарплата set [Надбавка за стаж, руб] = 0 where [Стаж, лет] = 0
update Зарплата set [Надбавка за стаж, руб] = [Оклад, руб] * 0.05 where [Стаж, лет] between 1 and 5
update Зарплата set [Надбавка за стаж, руб] = [Оклад, руб] * 0.1 where [Стаж, лет] between 6 and 10
update Зарплата set [Надбавка за стаж, руб] = [Оклад, руб] * 0.15 where [Стаж, лет] between 11 and 15
update Зарплата set [Надбавка за стаж, руб] = [Оклад, руб] * 0.2 where [Стаж, лет] > 15
update Зарплата set [Надбавка за стаж, руб] = round([Надбавка за стаж, руб], 2), [Итого, руб] = round(([Оклад, руб] + [Премия, руб] + [Надбавка за стаж, руб]), 2)
update Зарплата set [Налоги, руб] = round(([Итого, руб] * 0.13) , 2)
update Зарплата set [Получить, руб] = [Итого, руб] - [Налоги, руб]
      


select * from Зарплата;